In [1]:
import pandas as pd

In [2]:
# Create a list, tuple, set with elements 1 to 5
# create a list of indexes [a,...e]
# map the indexes with the elements
# convert each of these types into pandas series

In [15]:
list1=[1,2,3,4,5]
tup1=(1,2,3,4,5)
set1={1,2,3,4,5}
ind=['a','b','c','d','e']

In [16]:
list_ser = pd.Series(list1, index = ind)
list_ser

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [17]:
tup_ser = pd.Series(tup1, index = ind)
tup_ser

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [22]:
#set_ser = pd.Series(set1, index = ind)
#set_ser
# Set is unordered

In [23]:
# Create a dictionary  with 5 key-value pairs
# convert into a pandas series

In [27]:
data={
   " Name" :"Shyam",
    "Age" :30,
    "Country" : "India"
}
dict_Ser = pd.Series(data)
dict_Ser

 Name      Shyam
Age           30
Country    India
dtype: object

In [28]:
# Create a sample series of 8 elements
# print the first 5 elements
# print the last 5 elements
# update the 5th index with value 500
# delete the first element

In [29]:
sample=pd.Series([1,2,3,4,5,6,7,8])
sample

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
dtype: int64

In [30]:
sample[0:5]

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [33]:
sample.head()

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [34]:
sample.tail()

3    4
4    5
5    6
6    7
7    8
dtype: int64

In [35]:
sample[-5:]

3    4
4    5
5    6
6    7
7    8
dtype: int64

In [36]:
sample[5]=500

In [37]:
sample

0      1
1      2
2      3
3      4
4      5
5    500
6      7
7      8
dtype: int64

In [38]:
# iloc

In [40]:
sample.drop(0, inplace=True)

In [41]:
sample

1      2
2      3
3      4
4      5
5    500
6      7
7      8
dtype: int64

In [42]:
# create a nested list and dict(store the values in the form of list)
# convert these into pandas dataframes

In [43]:
nested_list=[["Krishna", "10th ", "A"],["RAhul","11th","B"],["Ajay","12th","C"]]

In [44]:
nested_list

[['Krishna', '10th ', 'A'], ['RAhul', '11th', 'B'], ['Ajay', '12th', 'C']]

In [45]:
df1=pd.DataFrame(nested_list , columns =["Name","Class","Sec"])

In [46]:
df1

      Name  Class Sec
0  Krishna  10th    A
1    RAhul   11th   B
2     Ajay   12th   C

In [47]:
dict1 = {
    "Car": ["Audi","BMW","Mahindra","Creta"],
    "Price": [10000,20000,300000,2500000],
    "Year": [2011,2012,2013,2015]
}
df2 = pd.DataFrame(dict1)
df2

        Car    Price  Year
0      Audi    10000  2011
1       BMW    20000  2012
2  Mahindra   300000  2013
3     Creta  2500000  2015

In [48]:
df2.rename(columns={"Car":"Model"}, inplace=True)

In [49]:
df2

      Model    Price  Year
0      Audi    10000  2011
1       BMW    20000  2012
2  Mahindra   300000  2013
3     Creta  2500000  2015

In [50]:
dic={
    'car':['audi','bmw','thor'],
    'price':[1000,2000,3000],
    'year':[2011,2012,2013]
}
dict1=pd.DataFrame(dic)
dict1.rename(columns={'car':'model'},inplace=True)
dict1

  model  price  year
0  audi   1000  2011
1   bmw   2000  2012
2  thor   3000  2013

In [51]:
df2[df2["Year"]>2012]

      Model    Price  Year
2  Mahindra   300000  2013
3     Creta  2500000  2015

In [52]:
# Select all the rows where the model is BMW ,  and the year is greater than 2012
# Select all the rows where the model is BMW   or the year is greater than 2012

In [53]:
df1

      Name  Class Sec
0  Krishna  10th    A
1    RAhul   11th   B
2     Ajay   12th   C

In [54]:
df2

      Model    Price  Year
0      Audi    10000  2011
1       BMW    20000  2012
2  Mahindra   300000  2013
3     Creta  2500000  2015

In [55]:
df2[(df2["Model"]=="BMW") &(df2["Year"]>=2012)]

  Model  Price  Year
1   BMW  20000  2012

In [56]:
df2[(df2["Model"] == "BMW") | (df2["Year"]> 2012)]

      Model    Price  Year
1       BMW    20000  2012
2  Mahindra   300000  2013
3     Creta  2500000  2015

In [57]:
# create a dataframe with two columns = ["Name",Age]
# in each columns put atleast 7 values
# print the first and last 3 rows
# update the 5th row

In [60]:
listt=[["Prathibha" , "19"],["Koushal" , "16"],["Durgaprasad","54"],
       ["Nethra" , "44"],["koushal" ,"15"],["Supriya" ,"12"],["Navya" , "20"]]

In [67]:
df3=pd.DataFrame(listt , columns=["Name" , "Age"])

In [68]:
df3

          Name Age
0    Prathibha  19
1      Koushal  16
2  Durgaprasad  54
3       Nethra  44
4      koushal  15
5      Supriya  12
6        Navya  20

In [69]:
df3[0:3]

          Name Age
0    Prathibha  19
1      Koushal  16
2  Durgaprasad  54

In [70]:
df3[3:6]

      Name Age
3   Nethra  44
4  koushal  15
5  Supriya  12

In [74]:
df3.loc[4] = ["Priya", 25  ]

In [72]:
df3

          Name Age
0    Prathibha  19
1      Koushal  16
2  Durgaprasad  54
3       Nethra  44
4        Priya  25
5      Supriya  12
6        Navya  20

In [79]:
df3 = df3.drop("Age", axis=1, inplace=True)

In [81]:
df3

In [82]:
# Group by - split the data into groups based upon a column

In [83]:
# Take a dataset , column as dept,column as emp, column as sal
# average of all the values based on columnn dept, salary
# i want the average of department wise salary
# Implement group by
# df.groupby()

In [86]:
# dept : ["IT","HR","Finance","HR","Finance"]
# Emp : ["A","B","C","D","E"]
# Salary : [6000,2000,4000,3000,2000]

In [85]:
data = {
    "Dept" : ["IT","HR","Finance","HR","Finance"],
    "Emp" : ["A","B","C","D","E"],
    "Salary" : [6000,2000,4000,3000,2000]

}
df = pd.DataFrame(data)
df

      Dept Emp  Salary
0       IT   A    6000
1       HR   B    2000
2  Finance   C    4000
3       HR   D    3000
4  Finance   E    2000

In [87]:
df.groupby('Dept')['Salary'].mean()

Dept
Finance    3000.0
HR         2500.0
IT         6000.0
Name: Salary, dtype: float64

In [111]:
df.columns = df.columns.str.strip()
df

        sport  age
0     cricket   19
1    football   22
2   badminton   20
3  basketball   50
4  volleyball   42

In [88]:
# loc - Label based indexing
# iloc - position based indexing

In [89]:
# Create a pandas series with marks of 5 students
# Map with some indexes[a,b,c,d,e]
# access the marks of the 3rd student with both loc , iloc

In [90]:
sr1= pd.Series([23,43,54,76,67], index = ['a','b','c','d','e'])
print(sr1.loc['c']) #Label based indexing
print(sr1.iloc[2])# position based indexing

54
54

In [91]:
# take two series , perform add, sub operation
# create a series of 10 numbers , i want only the even numbers , use filtering

In [92]:
s1 = pd.Series([1,2,3,4,5])
s2 = pd.Series([6,7,8,9,10])
result = s1 + s2
result
result1 = s1 - s2
result1
print(s1.add(s2))
print(s1.subtract(s2))

0     7
1     9
2    11
3    13
4    15
dtype: int64
0   -5
1   -5
2   -5
3   -5
4   -5
dtype: int64

In [93]:
s = pd.Series(range(1,11))
even = s[s%2==0]
even

1     2
3     4
5     6
7     8
9    10
dtype: int64

In [94]:
# Create a DataFrame of employees
# Name , dept, salary
# Display all the employees  working in the IT department
# add a new column Bonus = 10 % of salary
# Find the average salary of the employees
# Change the column name from Salary to CTC.

In [95]:
data = {
    'name': ['Vansh', 'Dhruv', 'Virat', 'Rohit', 'Dhoni'],
    'dept': ['HR', 'IT', 'Finance', 'IT', 'Marketing'],
    'salary': [50000, 60000, 55000, 65000, 52000]
}
df = pd.DataFrame(data)
it_employees = df[df['dept'] == 'IT']
print("Employees in IT department:")
print(it_employees)
df['bonus'] = df['salary'] * 0.10
average_salary = df['salary'].mean()
print(f"\nAverage salary of employees: {average_salary}")
df.rename(columns={'salary': 'ctc'}, inplace=True)
print("\nUpdated DataFrame:")
print(df)

Employees in IT department:
    name dept  salary
1  Dhruv   IT   60000
3  Rohit   IT   65000

Average salary of employees: 56400.0

Updated DataFrame:
    name       dept    ctc   bonus
0  Vansh         HR  50000  5000.0
1  Dhruv         IT  60000  6000.0
2  Virat    Finance  55000  5500.0
3  Rohit         IT  65000  6500.0
4  Dhoni  Marketing  52000  5200.0

In [96]:
# Create a Data frame with columns sports and Age
# Take atleast 5 values
# search/filter for the name/names where the age is 20
# sort the dataframe in both ascending and decending order of age
# using python loops, print the ages from the dataframe and store in a set

In [97]:
df = pd.DataFrame({
    "sport": ["cricket", "football", "badminton", "basketball", "volleyball"],
    "age": [19, 22, 20, 50, 42]
})
print(df)
print(df[df['age'] == 20])
print(df.sort_values(by = "age"))
print(df.sort_values(by = "age",ascending=False))
sets = set()

for age in df["age"]:
    sets.add(age)

print(sets)

        sport  age
0     cricket   19
1    football   22
2   badminton   20
3  basketball   50
4  volleyball   42
       sport  age
2  badminton   20
        sport  age
0     cricket   19
2   badminton   20
1    football   22
4  volleyball   42
3  basketball   50
        sport  age
3  basketball   50
4  volleyball   42
1    football   22
2   badminton   20
0     cricket   19
{42, 50, 19, 20, 22}

In [98]:
# Create two separate data Frames A and B
# concatenate the 2 dataframes to a new dataframe C
# Split the dataframe  C row wise

In [112]:
import pandas as pd

A = pd.DataFrame({
    "Name": ["Asha", "Rahul", "Sneha"],
    "Age": [21, 22, 20]
})

A

    Name  Age
0   Asha   21
1  Rahul   22
2  Sneha   20

In [113]:
B = pd.DataFrame({
    "Name": ["Kiran", "Meera", "Arjun"],
    "Age": [23, 24, 22]
})

B

    Name  Age
0  Kiran   23
1  Meera   24
2  Arjun   22

In [114]:
C = pd.concat([A, B], ignore_index=True)

C

    Name  Age
0   Asha   21
1  Rahul   22
2  Sneha   20
3  Kiran   23
4  Meera   24
5  Arjun   22

In [115]:
#Why ignore_index=True?
#Because otherwise indexes would repeat:

#0 1 2
#0 1 2


#With ignore_index=True  new clean index:

#0 1 2 3 4 5

In [116]:
# Split row-wise
mid = len(C) // 2
C1 = C.iloc[:mid]
C2 = C.iloc[mid:]

In [117]:
print(C1)

    Name  Age
0   Asha   21
1  Rahul   22
2  Sneha   20

In [118]:
print(C2)

    Name  Age
3  Kiran   23
4  Meera   24
5  Arjun   22

In [119]:
print(C)

    Name  Age
0   Asha   21
1  Rahul   22
2  Sneha   20
3  Kiran   23
4  Meera   24
5  Arjun   22